## An ERD to represent a database that tracks users and their favorite books.
<img src='Data/books-db-model.png'>

In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text

In [2]:
pymysql.install_as_MySQLdb()
db_name = "books"
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" # (whatever password you chose during mysql installation)
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
# create connection to database via the engine
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(text(q), conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [6]:
users=pd.read_excel('Data/users.xlsx')
users

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
books=pd.read_excel('Data/books.xlsx')
authors=pd.read_excel('Data/authors.xlsx')
favorites=pd.read_excel('Data/favorites.xlsx')

- Change the names in the dataframe to match those you used when creating the table in the database. (Notably, we will not have created_at and updated_at attributes)- 
Use DESCRIBE to view the datatypes of your table and compare them with the datatypes in your dataframe. Address any inconsistencie
- 
Add the data from the dataframe to the database table

In [9]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(text(q), conn)
describe

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

In [10]:
books

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [11]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(text(q), conn)
describe

  Field         Type Null  Key Default Extra
0    id          int   NO  PRI    None
1  name  varchar(45)  YES         None

In [12]:
authors

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [14]:
# altering the DataFrame
authors = authors.rename(columns={'author_name':'name'})
authors

   id               name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [15]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(text(q), conn)
describe

      Field Type Null  Key Default Extra
0  books_id  int   NO  MUL    None
1  users_id  int   NO  MUL    None

In [16]:
favorites

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

In [18]:
# altering the DataFrame
favorites = favorites.rename(columns={'book_id':'books_id','user_id':'users_id'})
favorites = favorites[['books_id', 'users_id']]
favorites

   books_id  users_id
0         1         1
1         2         1
2         3         1
3         4         2
4         5         2
5         5         3
6         6         3

In [20]:
users.to_sql("users",conn,index=False, if_exists='append')

3

In [21]:
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [22]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [23]:
# Inserting the data now that foreign key checks are disabled
favorites.to_sql("favorites",conn,index=False, if_exists='append')
books.to_sql("books",conn,index=False, if_exists='append')

6

In [24]:
q = '''SELECT * from favorites;'''
pd.read_sql(text(q), conn)

   books_id  users_id
0         1         1
1         2         1
2         3         1
3         4         2
4         5         2
5         5         3
6         6         3

In [26]:
q = '''
SELECT books.title, favorites.users_id
FROM books
JOIN favorites ON books.id = favorites.books_id
WHERE favorites.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
    '''
pd.read_sql(text(q), conn)

OperationalError: (pymysql.err.OperationalError) (1054, "Unknown column 'favorites.book_id' in 'on clause'")
[SQL:
SELECT books.title, favorites.users_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.users_id =
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
    ]
(Background on this error at: https://sqlalche.me/e/14/e3q8)